[
    {
        "T": "n",
        "id": 38640581,
        "headline": "Sensus Healthcare Announces Sale Of First SRT-100 Vision System To Asia; No Financial Terms Disclosed",
        "summary": "Sensus Healthcare, Inc. (NASDAQ:SRTS), a medical device company specializing in highly effective, non-invasive treatments for both oncological and non-oncological conditions, announces the sale of the first SRT-100",
        "author": "Benzinga Newsdesk",
        "created_at": "2024-05-06T12:17:16Z",
        "updated_at": "2024-05-06T12:17:17Z",
        "url": "https://www.benzinga.com/news/24/05/38640581/sensus-healthcare-announces-sale-of-first-srt-100-vision-system-to-asia-no-financial-terms-disclosed",
        "content": "\u003cp\u003e\u003cstrong\u003eSensus Healthcare, Inc. (NASDAQ:\u003c/strong\u003e\u003ca href=\"https://www.benzinga.com/stock/SRTS#NASDAQ\"\u003e\u003cstrong\u003eSRTS\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e), \u003c/strong\u003ea medical device company specializing in highly effective, non-invasive treatments for both oncological and non-oncological conditions, announces the sale of the first SRT-100 Vision\u0026#x2122; (IG-SRT) system in Asia, to Far Eastern Memorial Hospital in Taiwan.\u0026nbsp; The hospital, which has more than 1,000 beds, is one of the largest private hospitals in Taiwan.\u003c/p\u003e\u003cp\u003eFar Eastern Memorial Hospital also plans to publish research on possible new indications for the SRT-100 Vision (IG-SRT), which may be instrumental in the support of label expansion beyond non-melanoma skin cancer and keloids worldwide.\u003c/p\u003e\u003cp\u003e\"We are delighted to sell the first SRT-100 Vision system in Asia, in particular to such a prominent hospital as Far Eastern Memorial,\" said Benson Suen, Sensus Healthcare's Vice President of Internation Sales. \"We are optimistic this sale will open the door to additional sales of our premium-featured Vision system in the region, including across China. In addition, Far Eastern Memorial Hospital will serve as the Vision reference center and is expected to help us promote awareness of the system.\"\u003c/p\u003e\u003cp\u003eThe SRT-100 Vision (IG-SRT), a Sensus Healthcare exclusive, utilizes image-guided ultrasound. Sentinel\u0026#x2122; technology, which contains HIPAA-compliant software with clinical, billing and asset-management utility also may be available in this system. \u0026nbsp;In addition, last year Sensus introduced an important new and improved high-resolution ultrasound technology to provide See \u0026amp; Treat capability. This leads to excellent clinical outcomes because the physician can see the impact of each treatment on the lesion, and lesion resolution following treatment.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFirst Quarter Conference Call and Webcast\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSensus reminds investors that management will be hosting a conference call on Thursday, May 9, 2024 at 4:30 p.m. Eastern time to discuss financial results for the first quarter of 2024. In addition, management will provide a business update and review recent and upcoming milestones.\u003c/p\u003e\u003cp\u003eParticipants are encouraged to pre-register for the conference call using this \u003ca href=\"https://www.globenewswire.com/Tracker?data=jU7CkNj8fqFJF-9SUNFSf6hJGV7BTR8Ry0Ov6uhLEEKTbeXmGe_NFipxoY2-xor2juFmdPX6kWu0tuYeS7Ai2INQIpkSVYeOesFjYD00TLTdb7v01OtcWTCQCNdayBKR_LFwOZ-HURQREHA51pnZ3IRiwCL-e04KW1yoRbUuGhzUsmlopLnOsEr2nO_vRqZm\"\u003elink\u003c/a\u003e. Upon registration participants will receive a unique dial in number that will permit them to bypass the live operator. Participants may pre-register at any time, including up to and after the call start time. Those without internet access or unable to pre-register may access the conference call by dialing, 1-844-481-2811 (U.S. and Canada Toll Free) or 1-412-317-0676 (International). Please direct the operator to be connected to the Sensus Healthcare conference call.\u003c/p\u003e\u003cp\u003eThe call will be webcast live and can be accessed at this \u003ca href=\"https://www.globenewswire.com/Tracker?data=isXX-HMqUvkl6HiO7vKFyiMe_Pwj_PHL67uXw9FbcRLVsDiHCK9tMVaBs6QobrHQUxnTUw_Sdw2XFMUz4Mjg9HKu5QxIi30MRjWZvU8LKdf1q2bgucL4L_hhX_A59VL2923XamSorA7xmGKabMg_RA==\"\u003elink,\u003c/a\u003e which also may be found in the Investor Relations section of the Company's website at \u003ca href=\"http://www.sensushealthcare.com/\"\u003ewww.sensushealthcare.com\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFollowing the conclusion of the conference call, a telephone replay will be available until June 9th, and can be accessed by dialing 877-344-7529 (U.S. Toll Free), 855-669-9658 (Canada Toll Free), or 412-317-0088 (International).\u0026nbsp; At the system prompt, dial the replay code – 9785929 – followed by the # sign. Playback will automatically begin. An archived webcast of the call will also be available in the Investor Relations section of the Company's website for a period of time.\u003c/p\u003e",
        "symbols": [
            "SRTS"
        ],
        "source": "benzinga"
    }
]